# CircularLoopInPipeSizing Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PipingFailures..::..CircularLoopInPipeSizing Property
BuiltInFailures..::..PipingFailures Class See Also
---
Circular loop detected during pipe sizing. The loop may be avoided by modifying segment settings in the pipe routing preference.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CircularLoopInPipeSizing { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CircularLoopInPipeSizing As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CircularLoopInPipeSizing {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PipingFailures Class
Autodesk.Revit.DB Namespace